koki-iwaizumi/ble-cycle-client/STM32_WPAN/App/app_ble.c
        switch (meta_evt->subevent)
        {
          /* USER CODE BEGIN subevent */

          /* USER CODE END subevent */

          case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        	connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
			if (connection_complete_event->Status != 0x00) break;

			APP_DBG_MSG("Connected to device %d\r\n", current_connection_index + 1);

			SensorDevices[current_connection_index].connected = 1;
			current_connection_index++;
			if (current_connection_index < num_sensors_found) Connect_To_Next_Sensor();

			BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
			APP_DBG_MSG("Set connection handle: 0x%04X\n\r", BleApplicationContext.BleApplicationContext_legacy.connectionHandle);

            result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
            if (result != BLE_STATUS_SUCCESS) APP_DBG_MSG("aci_gatt_disc_all_primary_services Failed \r\n\r");
            break;

          case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
            {
            	uint8_t *adv_report_data;

            	le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;
            	event_type = le_advertising_event->Advertising_Report[0].Event_Type;
            	event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;
            	adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;

                uint8_t addr_type = le_advertising_event->Advertising_Report[0].Address_Type;
                uint8_t *addr = le_advertising_event->Advertising_Report[0].Address;

				// すでにリストに存在するかチェック（重複除外）
				if (is_duplicate_devices(addr) || num_sensors_found == MAX_DEVICES) break;

            	k = 0;

				while(k < event_data_size)
				{
				  adlength = adv_report_data[k];
				  adtype = adv_report_data[k + 1];
				  switch (adtype)
				  {
					  case AD_TYPE_COMPLETE_LOCAL_NAME:
					  case AD_TYPE_SHORTENED_LOCAL_NAME:
						  char local_name[32] = {0}; // 最大31バイト (BLEの制約)
						  uint8_t name_length = adlength - 1; // AD Typeの1バイトを除く

						  if (name_length > sizeof(local_name) - 1)
						 {
							 name_length = sizeof(local_name) - 1; // バッファオーバーフロー防止
						 }

						 memcpy(local_name, &adv_report_data[k + 2], name_length); // ADデータをコピー
						 local_name[name_length] = '\0'; // NULL終端

						 if (strcmp(local_name, "XOSS_VOR_S5546") != 0 && strcmp(local_name, "ASSIOMA46734L") != 0) break;

						 // 接続対象のデバイスとして登録
						 SensorDevices[num_sensors_found].addr_type = addr_type;
						 memcpy(SensorDevices[num_sensors_found].bd_addr, addr, 6);
						 SensorDevices[num_sensors_found].connected = 0;

						 APP_DBG_MSG("New device %d found: Addr = %02X:%02X:%02X:%02X:%02X:%02X Name=%s\r\n", num_sensors_found + 1, addr[5], addr[4], addr[3], addr[2], addr[1], addr[0], local_name);

						 num_sensors_found++;

						 break;

					  default:
						  break;
				  }
				  k += adlength + 1;
				}
            }
            break;

          /* USER CODE BEGIN META_EVT */

          /* USER CODE END META_EVT */

          default:
            /* USER CODE BEGIN subevent_default */

            /* USER CODE END subevent_default */
            break;
        }
      }
      break; /* HCI_LE_META_EVT_CODE */

    /* USER CODE BEGIN EVENT_PCKT */

    /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN evt_default */

      /* USER CODE END evt_default */
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Client_Connection_Status(uint16_t Connection_Handle)
{
  if (BleApplicationContext.BleApplicationContext_legacy.connectionHandle == Connection_Handle)
  {
    return BleApplicationContext.Device_Connection_Status;
  }
  return APP_BLE_IDLE;
}
/* USER CODE BEGIN FD */

/* USER CODE END FD */
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init(void)
{
  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

  Hci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&BleCmdBuffer;
  Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
  hci_init(BLE_UserEvtRx, (void*) &Hci_Tl_Init_Conf);

  return;
}

static void Ble_Hci_Gap_Gatt_Init(void)
{
  uint8_t role;
  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
  const uint8_t *p_bd_addr;

  uint16_t a_appearance[1] = { BLE_CFG_GAP_APPEARANCE };
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  APP_DBG_MSG("==>> Start Ble_Hci_Gap_Gatt_Init function\n");

  /**
   * Initialize HCI layer
   */
  /*HCI Reset to synchronise BLE Stack*/
  ret = hci_reset();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : hci_reset command, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: hci_reset command\n");
  }

  uint8_t random_address[6] = {0xC0, 0xFF, 0xEE, 0xAA, 0xBB, 0xCC}; // 任意のランダムアドレス

  ret = aci_hal_write_config_data(CONFIG_DATA_RANDOM_ADDRESS_OFFSET, 6, random_address);
  if (ret != BLE_STATUS_SUCCESS) {
      APP_DBG_MSG("Failed to set random address. Error code: 0x%02X\r\n", ret);
  } else {
      APP_DBG_MSG("Random address set successfully.\r\n");
  }

  /**
   * Write the BD Address
   */
//  p_bd_addr = BleGetBdAddress();
//  ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET, CONFIG_DATA_PUBADDR_LEN, (uint8_t*) p_bd_addr);
//  if (ret != BLE_STATUS_SUCCESS)
//  {
//    APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET, result: 0x%x \n", ret);
//  }
//   else
//   {
//    APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET\n");
//    APP_DBG_MSG("  Public Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n",p_bd_addr[5],p_bd_addr[4],p_bd_addr[3],p_bd_addr[2],p_bd_addr[1],p_bd_addr[0]);
//   }

  /**
   * Write Identity root key used to derive IRK and DHK(Legacy)
   */
  ret = aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)a_BLE_CfgIrValue);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET\n");
  }

  /**
   * Write Encryption root key used to derive LTK and CSRK
   */
  ret = aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t*)a_BLE_CfgErValue);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET\n");
  }

